In [41]:
import pandas as pd

In [42]:
data = pd.read_csv("C:\\Users\\TOHED\\Desktop\\day5.txt", names=["content"])

In [43]:
airplane = pd.DataFrame(list(zip(data['content'].str.slice(stop=7), data['content'].str.slice(start=-3))), columns=['Row', 'Seat'])

In [44]:
airplane

         Row Seat
0    BFFFBBF  RLR
1    FBFFFBB  LRL
2    BFFFFFB  RRR
3    FBBBFFF  LRR
4    FFBFBFB  RLL
..       ...  ...
784  BFBBBFB  RRL
785  FFFBBBB  LLL
786  BBFBFBB  RRL
787  FFBFFBB  LRR
788  FBBFFBF  LLR

[789 rows x 2 columns]

In [45]:
data

        content
0    BFFFBBFRLR
1    FBFFFBBLRL
2    BFFFFFBRRR
3    FBBBFFFLRR
4    FFBFBFBRLL
..          ...
784  BFBBBFBRRL
785  FFFBBBBLLL
786  BBFBFBBRRL
787  FFBFFBBLRR
788  FBBFFBFLLR

[789 rows x 1 columns]

In [46]:
airplane['Row'] = airplane['Row'].str.replace('F','0')
airplane['Row'] = airplane['Row'].str.replace('B','1')
airplane['Seat'] = airplane['Seat'].str.replace('L','0')
airplane['Seat'] = airplane['Seat'].str.replace('R','1')

In [47]:
airplane

         Row Seat
0    1000110  101
1    0100011  010
2    1000001  111
3    0111000  011
4    0010101  100
..       ...  ...
784  1011101  110
785  0001111  000
786  1101011  110
787  0010011  011
788  0110010  001

[789 rows x 2 columns]

In [56]:
airplane['Row'] = airplane['Row'].transform(lambda x: int(x,2))
airplane['Seat'] = airplane['Seat'].transform(lambda x: int(x,2))

In [57]:
airplane

     Row  Seat
0     70     5
1     35     2
2     65     7
3     56     3
4     21     4
..   ...   ...
784   93     6
785   15     0
786  107     6
787   19     3
788   50     1

[789 rows x 2 columns]

In [60]:
max(airplane['Row']*8+airplane['Seat'])

864

In [67]:
seatIDs = (airplane['Row']*8+airplane['Seat'])
j = min(seatIDs)
for i in seatIDs.sort_values():
    if i != j:
        break
    j += 1

In [68]:
j

739

In [69]:
i

740